In [1]:
# Aula 02 - Configuração de ambiente Python

In [2]:
print('Inteligencia Artificial e Big Data - aula 02')

Inteligencia Artificial e Big Data - aula 02

In [ ]:
# instalação biblioteca pandas
!pip install pandas

In [4]:
# importar a biblioteca pandas
import pandas as pd

In [5]:
# Criando um dicionario no Python

Dicionario = {
    'A': [1,2,3],
    'B':[-3,-2,-1],
    'C':[0,10,20]
}

# Criando um index para linhas do dicionario
Label = ['1ª Linha','2ª Linha','3ª Linha']

# Criar o Dataframe
Dataframe_01 = pd.DataFrame(Dicionario,index=Label)
print(Dataframe_01)

          A  B   C
1ª Linha  1 -3   0
2ª Linha  2 -2  10
3ª Linha  3 -1  20

In [6]:
# Selecionando colunas A e B
Dataframe_01[['A','B']]

          A  B
1ª Linha  1 -3
2ª Linha  2 -2
3ª Linha  3 -1

In [7]:
# Selecionando as colunas A e C
Dataframe_01[['A','C']]

          A   C
1ª Linha  1   0
2ª Linha  2  10
3ª Linha  3  20

In [8]:
# Criando uma nova coluna no Dataframe
Dataframe_01['Nova coluna'] = Dataframe_01['A']*Dataframe_01['B']

In [9]:
# Exibindo o Dataframe
Dataframe_01

          A  B   C  Nova coluna
1ª Linha  1 -3   0           -3
2ª Linha  2 -2  10           -4
3ª Linha  3 -1  20           -3

In [12]:
# Exibindo mais de um valor na celula do Jupyter notebook
a =5
print(a)
Dataframe_01

5

          A  B   C  Nova coluna
1ª Linha  1 -3   0           -3
2ª Linha  2 -2  10           -4
3ª Linha  3 -1  20           -3

In [13]:
# Excluindo uma coluna do Dataframe
Dataframe_01.drop('Nova coluna',axis=1) # drop exclui a coluna do
# Dataframe

          A  B   C
1ª Linha  1 -3   0
2ª Linha  2 -2  10
3ª Linha  3 -1  20

In [ ]:
Dataframe_01.drop('1ª Linha',axis=0) # drop exclui a linha  do
# Dataframe

          A  B   C  Nova coluna
2ª Linha  2 -2  10           -4
3ª Linha  3 -1  20           -3

In [17]:
Dataframe_01

          A  B   C  Nova coluna
1ª Linha  1 -3   0           -3
2ª Linha  2 -2  10           -4
3ª Linha  3 -1  20           -3

In [18]:
# Excluindo uma coluna do Dataframe de forma permanente
Dataframe_01.drop('Nova coluna',axis=1,inplace=True) # drop exclui a coluna do
# Dataframe

In [19]:
Dataframe_01

          A  B   C
1ª Linha  1 -3   0
2ª Linha  2 -2  10
3ª Linha  3 -1  20